[
    {
      "id": 1,
      "name": "QMATIC System",
      "description":"Implemented the QMATIC system with the goal to enhance customer service efficiency. The primary objectives of the project were to reduce customer service time, minimize delays, automate processes, and enhance employee capacity",
      "tools": "Tableau,SQL, Qudini",
      "skills": "PM (Project Management), Data Analytics, Staff Training, Process Automation",
      "categoryId": 3,
      "image": "/images/Qmatic.jpeg",
      "githubLink": "https://github.com/project1",
      "achievements": ["Reduced customer service time from 40 minutes to 20 minutes",
      "Decreased delay periods from 1 hour to 10 minutes",
      "Automated various manual processes",
      "Increased the capacity and efficiency of employees"]
    },
    {
      "id": 2,
      "name": "Agile Transformation",
      "description": "A Company with 7,000 employees (TBC BANK) needed to change its corporate culture and management methodology",
      "tools": "Jira",
      "skills": "SAFe 5.1, Change management, Collaborative teamwork",
      "categoryId": 3,
      "image": "/images/adgile.jpeg",
      "githubLink": "https://github.com/project2",
      "achievements": [
        "Increased project delivery rate by 30%",
        "Enhanced team efficiency by 10%",
        "Implemented agile methodologies with McKinsey for substantial organizational improvements"
    ]
    },
    {
      "id": 3,
      "name": "Multi-Currency Loan",
      "description": "Many customers faced dissatisfaction due to disparities between their loan currency and salary currency, leading to fluctuating monthly payments caused by exchange rate variations. This inconsistency not only created confusion for customers but also increased the risk for the bank, making it challenging to manage and predict cash flows accurately",
      "tools": "API Integration, Product Development, Risk Assessment Algorithms, UI/UX Design",
      "skills": "Business Analysis, Python ",
      "categoryId": 3,
      "image": "/images/multi.webp",
      "githubLink": "",
      "achievements": [
        "Increased positive feedback by 40%, reducing complaints by 23%",
        "Decreased company risk rate by 10% through strategic currency risk management",
        "Contributed to a 5% profit increase and 3% decrease in non-performing loans"
    ]
    },
    {
      "id": 4,
      "name": "Loan Management System(LMS)Deployment",
      "description": "The bank aimed to meet international standards for listing shares on the London Stock Market. Existing systems lacked efficiency, hindering the bank's ability to produce new products swiftly and exposing it to unnecessary risks. Data management was outdated, requiring a modern solution for seamless integration and migration",
      "tools": "System Architecture, SQL, API Integration (REST, SOAP), Python, ETL, Apache Kafka",
      "skills": "Analytical Thinking, Project Management, Risk Management",
      "categoryId": 2,
      "image": "/images/LMS.jpeg",
      "githubLink": "",
      "achievements": [
        "Successfully implemented a secure and scalable Loan Management System (LMS), meeting criteria for London Stock Market listing",
        "Orchestrated over 30 integrations, enhancing operational efficiency through REST and SOAP APIs",
        "Implemented middleware solutions using Apache Kafka, improving data management and accessibility",
        "Executed flawless data migration using ETL tools like Apache NiFi, ensuring a smooth transition and minimizing disruptions"
    ]
  },
  {
    "id": 5,
    "name": "Data Migration",
    "description": "Facilitating the integration of disparate data systems during the merger of two companies posed a challenge in executing a precise and efficient data migration from one company's system to another. The complexity lay in aligning divergent databases, structures, and ensuring data integrity throughout the process.",
    "tools": "ETL Processes (Apache NiFi), SQL, Data Mapping and Transformation Techniques, Change Management Strategies, Jira",
    "skills": "ETL, SQL, Jira",
    "categoryId": 2,
    "image": "/images/migration.png",
    "githubLink": "",
    "achievements": [
      "Zero Data Loss",
      "On-Time Delivery", 
      "99% Data Accuracy",
      "Smooth Operations Post-Migration",
      "$1 Million Vendor Discount"
  ]
},
{
  "id": 6,
  "name": "Personal Website",
  "description": "Creating a dynamic and responsive personal website to showcase skills and projects required a modern and efficient tech stack",
  "tools": "React, JavaScript, Docker, MySQL, JSON",
  "skills": "Frontend Development, Containerization, Database Management, Data Interchange, Git, Heroku, DNS, SSL",
  "categoryId": 2,
  "image": "/images/personal.png",
  "githubLink": "",
  "achievements": [
    "Dynamic User Interface",
    "Interactive Functionality",
    "Efficient Deployment with Docke", 
    "Structured Database Management"
]
},
{
  "id": 7,
  "name": "Credit Risk Assesment",
  "description": "",
  "tools": "",
  "skills": "",
  "categoryId": 1,
  "image": "/images/creditrisk.jpeg",
  "githubLink": "",
  "achievements": [
]
},
{
  "id": 8,
  "name": "Degree",
  "description": "",
  "tools": "",
  "skills": "",
  "categoryId": 1,
  "image": "/images/degree.jpeg",
  "githubLink": "",
  "achievements": [
]
}
  ]
  